# LevelAssociationData Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
LevelAssociationData Members
LevelAssociationData Class Methods Properties See Also
---
The LevelAssociationData type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the LevelAssociationData |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAssociatedLevel | Returns the Associated Level id. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetLevelAssociationData | Returns LevelAssociationData associated with this element, if it exists. |
| GetLevelOffset | Returns the offset from the Associated Level. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetAssociatedLevel | Sets the Associated Level. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
LevelAssociationData Class
Autodesk.Revit.DB Namespace